ryankurte/efm32-base/device/EFR32BG14P/Include/efr32bg14p732f256gm32.h
/** @} End of group EFR32BG14P732F256GM32_Core */

/***************************************************************************//**
 * @defgroup EFR32BG14P732F256GM32_Part Part
 * @{
 ******************************************************************************/

/** Part family */
#define _EFR32_BLUE_FAMILY                      1                               /**< BLUE Gecko RF SoC Family  */
#define _EFR_DEVICE                                                             /**< Silicon Labs EFR-type RF SoC */
#define _SILICON_LABS_32B_SERIES_1                                              /**< Silicon Labs series number */
#define _SILICON_LABS_32B_SERIES                1                               /**< Silicon Labs series number */
#define _SILICON_LABS_32B_SERIES_1_CONFIG_4                                     /**< Series 1, Configuration 4 */
#define _SILICON_LABS_32B_SERIES_1_CONFIG       4                               /**< Series 1, Configuration 4 */
#define _SILICON_LABS_GECKO_INTERNAL_SDID       95                              /**< Silicon Labs internal use only, may change any time */
#define _SILICON_LABS_GECKO_INTERNAL_SDID_95                                    /**< Silicon Labs internal use only, may change any time */
#define _SILICON_LABS_EFR32_RADIO_SUBGHZ        1                               /**< Radio supports Sub-GHz */
#define _SILICON_LABS_EFR32_RADIO_2G4HZ         2                               /**< Radio supports 2.4 GHz */
#define _SILICON_LABS_EFR32_RADIO_DUALBAND      3                               /**< Radio supports dual band */
#define _SILICON_LABS_EFR32_RADIO_TYPE          _SILICON_LABS_EFR32_RADIO_2G4HZ /**< Radio type */

/* If part number is not defined as compiler option, define it */
#if !defined(EFR32BG14P732F256GM32)
#define EFR32BG14P732F256GM32    1 /**< BLUE Gecko Part */
#endif

/** Configure part number */
#define PART_NUMBER                "EFR32BG14P732F256GM32" /**< Part Number */

/** Memory Base addresses and limits */
#define RAM0_CODE_MEM_BASE         (0x10000000UL)          /**< RAM0_CODE base address  */
#define RAM0_CODE_MEM_SIZE         (0x4000UL)              /**< RAM0_CODE available address space  */
#define RAM0_CODE_MEM_END          (0x10003FFFUL)          /**< RAM0_CODE end address  */
#define RAM0_CODE_MEM_BITS         (0x0000000EUL)          /**< RAM0_CODE used bits  */
#define RAM2_MEM_BASE              (0x20008000UL)          /**< RAM2 base address  */
#define RAM2_MEM_SIZE              (0x800UL)               /**< RAM2 available address space  */
#define RAM2_MEM_END               (0x200087FFUL)          /**< RAM2 end address  */
#define RAM2_MEM_BITS              (0x0000000BUL)          /**< RAM2 used bits  */
#define RAM1_MEM_BASE              (0x20004000UL)          /**< RAM1 base address  */
#define RAM1_MEM_SIZE              (0x4000UL)              /**< RAM1 available address space  */
#define RAM1_MEM_END               (0x20007FFFUL)          /**< RAM1 end address  */
#define RAM1_MEM_BITS              (0x0000000EUL)          /**< RAM1 used bits  */
#define PER_MEM_BASE               (0x40000000UL)          /**< PER base address  */
#define PER_MEM_SIZE               (0xF0000UL)             /**< PER available address space  */
#define PER_MEM_END                (0x400EFFFFUL)          /**< PER end address  */
#define PER_MEM_BITS               (0x00000014UL)          /**< PER used bits  */
#define RAM1_CODE_MEM_BASE         (0x10004000UL)          /**< RAM1_CODE base address  */
#define RAM1_CODE_MEM_SIZE         (0x4000UL)              /**< RAM1_CODE available address space  */
#define RAM1_CODE_MEM_END          (0x10007FFFUL)          /**< RAM1_CODE end address  */
#define RAM1_CODE_MEM_BITS         (0x0000000EUL)          /**< RAM1_CODE used bits  */
#define FLASH_MEM_BASE             (0x00000000UL)          /**< FLASH base address  */
#define FLASH_MEM_SIZE             (0x10000000UL)          /**< FLASH available address space  */
#define FLASH_MEM_END              (0x0FFFFFFFUL)          /**< FLASH end address  */
#define FLASH_MEM_BITS             (0x0000001CUL)          /**< FLASH used bits  */
#define CRYPTO0_MEM_BASE           (0x400F0000UL)          /**< CRYPTO0 base address  */
#define CRYPTO0_MEM_SIZE           (0x400UL)               /**< CRYPTO0 available address space  */
#define CRYPTO0_MEM_END            (0x400F03FFUL)          /**< CRYPTO0 end address  */
#define CRYPTO0_MEM_BITS           (0x0000000AUL)          /**< CRYPTO0 used bits  */
#define CRYPTO_MEM_BASE            CRYPTO0_MEM_BASE        /**< Alias for CRYPTO0_MEM_BASE */
#define CRYPTO_MEM_SIZE            CRYPTO0_MEM_SIZE        /**< Alias for CRYPTO0_MEM_SIZE */
#define CRYPTO_MEM_END             CRYPTO0_MEM_END         /**< Alias for CRYPTO0_MEM_END  */
#define CRYPTO_MEM_BITS            CRYPTO0_MEM_BITS        /**< Alias for CRYPTO0_MEM_BITS */
#define PER_BITCLR_MEM_BASE        (0x44000000UL)          /**< PER_BITCLR base address  */
#define PER_BITCLR_MEM_SIZE        (0xF0000UL)             /**< PER_BITCLR available address space  */
#define PER_BITCLR_MEM_END         (0x440EFFFFUL)          /**< PER_BITCLR end address  */
#define PER_BITCLR_MEM_BITS        (0x00000014UL)          /**< PER_BITCLR used bits  */
#define CRYPTO0_BITSET_MEM_BASE    (0x460F0000UL)          /**< CRYPTO0_BITSET base address  */
#define CRYPTO0_BITSET_MEM_SIZE    (0x400UL)               /**< CRYPTO0_BITSET available address space  */
#define CRYPTO0_BITSET_MEM_END     (0x460F03FFUL)          /**< CRYPTO0_BITSET end address  */
#define CRYPTO0_BITSET_MEM_BITS    (0x0000000AUL)          /**< CRYPTO0_BITSET used bits  */
#define CRYPTO_BITSET_MEM_BASE     CRYPTO0_BITSET_MEM_BASE /**< Alias for CRYPTO0_BITSET_MEM_BASE */
#define CRYPTO_BITSET_MEM_SIZE     CRYPTO0_BITSET_MEM_SIZE /**< Alias for CRYPTO0_BITSET_MEM_SIZE */
#define CRYPTO_BITSET_MEM_END      CRYPTO0_BITSET_MEM_END  /**< Alias for CRYPTO0_BITSET_MEM_END  */
#define CRYPTO_BITSET_MEM_BITS     CRYPTO0_BITSET_MEM_BITS /**< Alias for CRYPTO0_BITSET_MEM_BITS */
#define CRYPTO0_BITCLR_MEM_BASE    (0x440F0000UL)          /**< CRYPTO0_BITCLR base address  */
#define CRYPTO0_BITCLR_MEM_SIZE    (0x400UL)               /**< CRYPTO0_BITCLR available address space  */
#define CRYPTO0_BITCLR_MEM_END     (0x440F03FFUL)          /**< CRYPTO0_BITCLR end address  */
#define CRYPTO0_BITCLR_MEM_BITS    (0x0000000AUL)          /**< CRYPTO0_BITCLR used bits  */
#define CRYPTO_BITCLR_MEM_BASE     CRYPTO0_BITCLR_MEM_BASE /**< Alias for CRYPTO0_BITCLR_MEM_BASE */
#define CRYPTO_BITCLR_MEM_SIZE     CRYPTO0_BITCLR_MEM_SIZE /**< Alias for CRYPTO0_BITCLR_MEM_SIZE */
#define CRYPTO_BITCLR_MEM_END      CRYPTO0_BITCLR_MEM_END  /**< Alias for CRYPTO0_BITCLR_MEM_END  */
#define CRYPTO_BITCLR_MEM_BITS     CRYPTO0_BITCLR_MEM_BITS /**< Alias for CRYPTO0_BITCLR_MEM_BITS */
#define PER_BITSET_MEM_BASE        (0x46000000UL)          /**< PER_BITSET base address  */
#define PER_BITSET_MEM_SIZE        (0xF0000UL)             /**< PER_BITSET available address space  */
#define PER_BITSET_MEM_END         (0x460EFFFFUL)          /**< PER_BITSET end address  */
#define PER_BITSET_MEM_BITS        (0x00000014UL)          /**< PER_BITSET used bits  */
#define RAM2_CODE_MEM_BASE         (0x10008000UL)          /**< RAM2_CODE base address  */
#define RAM2_CODE_MEM_SIZE         (0x800UL)               /**< RAM2_CODE available address space  */
#define RAM2_CODE_MEM_END          (0x100087FFUL)          /**< RAM2_CODE end address  */
#define RAM2_CODE_MEM_BITS         (0x0000000BUL)          /**< RAM2_CODE used bits  */
#define RAM_MEM_BASE               (0x20000000UL)          /**< RAM base address  */
#define RAM_MEM_SIZE               (0x4000UL)              /**< RAM available address space  */
#define RAM_MEM_END                (0x20003FFFUL)          /**< RAM end address  */
#define RAM_MEM_BITS               (0x0000000EUL)          /**< RAM used bits  */

/** Bit banding area */
#define BITBAND_PER_BASE           (0x42000000UL) /**< Peripheral Address Space bit-band area */
#define BITBAND_RAM_BASE           (0x22000000UL) /**< SRAM Address Space bit-band area */

/** Flash and SRAM limits for EFR32BG14P732F256GM32 */
#define FLASH_BASE                 (0x00000000UL) /**< Flash Base Address */
#define FLASH_SIZE                 (0x00040000UL) /**< Available Flash Memory */
#define FLASH_PAGE_SIZE            2048U          /**< Flash Memory page size */
#define SRAM_BASE                  (0x20000000UL) /**< SRAM Base Address */
#define SRAM_SIZE                  (0x00008000UL) /**< Available SRAM Memory */
#define __CM4_REV                  0x0001U        /**< Cortex-M4 Core revision r0p1 */
#define PRS_CHAN_COUNT             12             /**< Number of PRS channels */
#define DMA_CHAN_COUNT             8              /**< Number of DMA channels */
#define EXT_IRQ_COUNT              42             /**< Number of External (NVIC) interrupts */

/** AF channels connect the different on-chip peripherals with the af-mux */
#define AFCHAN_MAX                 105U
/** AF channel maximum location number */
#define AFCHANLOC_MAX              32U
/** Analog AF channels */
#define AFACHAN_MAX                98U

/* Part number capabilities */

